app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "17"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 07 Sep 2012 15:20:11 UTC +00:00], ["updated_at", Fri, 07 Sep 2012 15:20:11 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 4], ["created_at", Sun, 09 Sep 2012 11:38:42 UTC +00:00], ["product_id", 17], ["quantity", 1], ["updated_at", Sun, 09 Sep 2012 11:38:42 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-09-08 14:37:57.128796' WHERE "line_items"."id" = 1