app/controllers/store_controller.rb

  def index
    @products = Product.order(:price)
---
SELECT "products".* FROM "products" ORDER BY title, price